<HTML>
<!-- $Id$ -->
	<HEAD>
		<META HTTP-EQUIV="content-type" CONTENT="text/html;charset=iso-8859-1">
		<TITLE>Was Sie tun k&ouml;nnen</TITLE>
		<META NAME="AppleFont" CONTENT="Lucida Grande,Helvetica">
		<META NAME="AppleSearchResultsFont" CONTENT="Lucida Grande,Helvetica">
	</HEAD>

	<BODY BGCOLOR="#ffffff" TOPMARGIN="0" LEFTMARGIN="0" MARGINHEIGHT="0" MARGINWIDTH="0">
<H2>Was Sie tun k&ouml;nnen</H2>
<H3>Video von Ihrer Webcam ansehen</H3>
<P>Schlie&szlig;en Sie Ihre USB webcam an. Wenn sie unterst&uuml;tzt wird, sollten Sie eine &quot;Verbunden mit ...&quot;-Mitteilung in der Statuszeile sehen. Klicken Sie auf das blaue Dreieck in der Werkzeugleiste des Fensters, um das Video zu starten. Voil&agrave;! Sie k&ouml;nnen mit &quot;Kameraeinstellungen&quot; Bildparameter nach Ihrem Belieben einstellen - welche Regler aktiv sind h&auml;ngt von Ihrer Kamera ab. Mit &quot;Einstellungen merken&quot; k&ouml;nnen Sie diese Einstellungen als Standardeinstellungen f&uuml;r sp&auml;tere Programmstarts sichern. Einstellungen f&uuml;r unterschiedliche Kameramodelle werden separat gesichert.</P>
<H3>Bilder speichern</H3>
<P>Klicken Sie auf die Kamera mit Blitzlicht in der Werkzeugleiste oder w&auml;hlen Sie &quot;Bild aufnehmen&quot; aus dem &quot;Steuerung&quot;-Men&uuml;. Es erscheint ein Fenster mit dem Bild, das sie gew&ouml;hnlich speichern k&ouml;nnen.</P>
<H3>Bilder von der Kamera herunterladen</H3>
<P>Wenn Sie eine Kamera anschlie&szlig;en, die als digitale Fotokamera genutzt werden kann und die Bilder enth&auml;lt, werden Sie gefragt, ob Sie die Bilder herunterladen wollen. Wenn Sie die Frage verneinen, k&ouml;nnen Sie dies nachholen, indem Sie &quot;Bilder herunterladen...&quot; aus dem &quot;Steuerung&quot;-Men&uuml; w&auml;hlen. Die Bilder werden in der Bildeinstellung heruntergeladen, die auch f&uuml;r Live-Video gilt.</P>
<H3>Mehrere Webcams</H3>
<P>Wenn Sie mehrere Webcams angeschlossen haben, k&ouml;nnen Sie zwischen ihnen wechseln, indem Sie &quot;N&auml;chste Kamera&quot; aus dem &quot;Steuerung&quot;-Men&uuml; w&auml;hlen.</P>
<H3>Andere Dinge</H3>
<P>Um Filme aufzunehmen, mehrere Kameras gleichzeitig zu sehen, an Videokonferenzen teilzunehmen, eine Live-Webcam im WWW anzubieten oder andere Dinge zu tun k&ouml;nnen Sie eine Vielzahl von QuickTime-kompatiblen Applikationen benutzen, wie z.B. BTV, BTV Pro, Oculus, CoolCam, iSpQ VideoChat und viele weitere. Kopieren oder bewegen Sie dazu &quot;macam.component&quot; in den Ordner &quot;QuickTime&quot; im Ordner &quot;Library&quot; auf der Hauptebene Ihrer Festplatte. Wenn Sie anschlie&szlig;end die  QuickTime-Anwendung starten, erscheint jede angeschlossene Kamera als zus&auml;tzliche Video-Eingangsquelle. Konsultieren Sie die Dokumentation des jeweiligen Programms f&uuml;r weitere Details.</P>
	</BODY>
</HTML>
